package test;

import java.net.InetAddress;

public class Main {
    public static void main(String[] args) throws Exception {
        String s="做一个类似2D版跳舞的线的音游，用html、js、css，可以上传音乐文件，有几种模式，首先，可以选择录制路径，点击鼠标开始后播放音乐，同时线启动，把所有线的身体记录下来，按下q后或音乐结束结束录制，这时候默认没有进行录制或正常游戏的时候为编辑模式，可以放置新的障碍物，这个时候，有一个新增按钮，点击后进入设置，可以选择放置物体的位置（包括xy坐标和旋转角度）、类型、形状、颜色和特效，类型分为路径（线可以走上去）、墙壁（线撞上之后游戏结束）和机关（碰到后会改变线的颜色、移动速度或大小，这几个在设置里要能调节和选择类型），线在移动时，只有在路径上才会有线的身体保留，也只有在路径上才能转向（这两个在路径上的判定都是蹭到一点就算）；形状要包含线、矩形、三角形、（椭）圆和其他多边形（在设置里手绘边缘点），物体的特效你帮我看看怎么搞，可以搞点发光什么的（选择时也要包含”无”）。然后，鼠标可以点击选中或者框选住障碍物，如果只选中了一个，那需要有一个界面可以调整它的属性，若是由多个物体合并的，那要能够选择拆分，从此他们将作为一个个独立的物体，坐标、选中全部分开处理；如果选中了多个，可以将他们进行合并操作，用鼠标选择一个中心坐标，作为一个新的物体，从此他们选中时将会一起被选中，调整位置时也是一起的；不管选中多少个，都要能够进行复制、剪切、删除的操作；然后如果选择了一个物体（单个或合并体）要可以编辑它们的行为，分为一直进行的行为和触发式的行为，一直进行的行为包含移动、旋转，这两个可以同时存在，旋转的行为就是设置一个不变的角速度还有旋转中心，移动行为设置要可以用鼠标选择每个关键帧的位置和关键帧之间的间隔，移动就先单纯线性的，一遍运动结束后选择从头开始重播还是倒着回去；然后就是触发式的，首先，触发的条件都是一致的，可以选择一块区域（矩形），若线经过了这个区域，就触发，触发式要包含旋转、移动（触发后开始运动，但是移动要选择是否重播，如果不重播，那运动完就停在结束的位置，若重播，则同上，可以选择从头开始还是倒着回去）还有隐身或现身，设置里要能选择动画的时长（从触发到完全现身或隐身），完全隐身之后就不与线进行交互了（如碰撞、作为路径、调整颜色速度...）；这些行为全部都是可以叠加在一起的（比如边现身边移动）。最后，线的碰撞判定只有一个线头（头部与线粗细一样的一个方块，只做判定，不显示），然后这些物体和鼠标交互都要有反馈，比如鼠标悬浮显示边界框，带触发式行为的物体的触发框也要用虚线围起来，但是所有这些提示类的渲染（触发框、鼠标悬浮反馈）在开始正式游戏后都要隐藏。然后就是线的碰撞、路径移动的判定都要完善，与物体的形状、坐标、旋转对应。编辑好的场景要能够保存和加载，音乐文件一并嵌入存档。游戏中线的机制应当与跳舞的线一样。然后提醒你一下，我知道这个代码会非常非常长，所以不要节省篇幅，全部写出来，不要漏掉我给你的任何一段指示。";
        System.out.println(s.length());
    }
}
